{
  "backend/main.mo": "Motoko backend handling user profiles, selfie submissions with simulated scoring, session storage, and permission checks via AccessControl.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for all frontend files across the project.",
  "frontend/index.css": "Tailwind base theme file defining OKLCH color tokens and dark-mode variables for global styling.",
  "frontend/index.html": "Root HTML file loading the React app entry point and defining the app container.",
  "frontend/src/App.tsx": "Main React app orchestrating authentication, profile setup, page navigation, and themed UI rendering.",
  "frontend/src/components/auth/AuthenticatedOnly.tsx": "Wrapper component that renders children only when a user is authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button managing Internet Identity login, logout, and loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter and save their display name.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component providing header, navigation tabs, footer, and wrapping page content.",
  "frontend/src/components/score/ScoreCard.tsx": "Displays current and potential selfie ratings with explanations, badges, and a disclaimer.",
  "frontend/src/features/history/HistoryEmptyState.tsx": "Shows an empty state encouraging users to take their first selfie, with an image and button.",
  "frontend/src/features/history/HistoryPage.tsx": "Fetches and displays a grid of past selfie sessions with ratings and timestamps, and opens a detailed score dialog.",
  "frontend/src/features/selfie/SelfiePage.tsx": "Handles capturing or uploading selfies, validating and uploading files, and showing resulting scores.",
  "frontend/src/features/workouts/WorkoutIllustrationCard.tsx": "Renders a card containing a workout illustration image.",
  "frontend/src/features/workouts/WorkoutsPage.tsx": "Lets users select workout preferences and generates a personalized workout plan with safety guidance.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, selfie sessions, and counts via an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light and dark themes.",
  "frontend/src/lib/blob-storage.ts": "Implements an ExternalBlob helper for creating blobs from URLs or bytes with optional upload progress tracking.",
  "frontend/src/lib/score/explanations.ts": "Generates badge labels and a description based on image result enums for selfie scoring.",
  "frontend/src/lib/score/format.ts": "Offers safe formatting and numeric conversion utilities for rating values.",
  "frontend/src/lib/selfie/upload.ts": "Reads a file into bytes, wraps it in ExternalBlob, tracks progress, and returns a generated URL.",
  "frontend/src/lib/selfie/validation.ts": "Validates selfie file type and size against JPEG/PNG/WebP and a 10MB limit.",
  "frontend/src/lib/workouts/generator.ts": "Builds workout plans based on goals, frequency, and equipment, returning structured exercise routines.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom themes, colors, containers, and animation utilities.",
  "project_state.json": "Defines the project’s current state, including app goals, features, issues, and image update requirements for a selfie-based looksmaxxing fitness app. Documents existing functionality, known bugs, and architectural notes for future development."
}